[
  {
    "title": "NHS issues flu jab SOS with worst of winter only weeks away",
    "description": "The NHS has issued a ‘flu jab SOS’, with England’s top nurse warning people to get protected now, with only weeks to go before the worst of the flu season typically bites. Eligible adults are being urged to come forward now, so they are fully protected ahead of the usual flu season peak in the [&#8230;]",
    "published": "Thu, 06 Nov 2025 10:17:55 +0000"
  },
  {
    "title": "NHS England responds to ADHD Taskforce final report",
    "description": "An independent taskforce established to tackle challenges in attention deficit hyperactivity disorder (ADHD) care has today (6 November 2025) published its final report. The ADHD Taskforce final report assessed services across health, education, employment, and the criminal justice system. The independent report recognises that cross-sector services across the country are under significant pressure due to [&#8230;]",
    "published": "Thu, 06 Nov 2025 09:27:14 +0000"
  },
  {
    "title": "Early flu wave could lead to ‘long and drawn out’ Winter for NHS",
    "description": "The flu season has hit the NHS more than a month earlier than usual, with cases three times higher than this time last year. The UK Health Security Agency’s (UKHSA’s) latest surveillance data published today shows cases have increased this week from 6.1% up to 8.2% &#8211; largely driven by a spike among school-aged children [&#8230;]",
    "published": "Thu, 30 Oct 2025 15:59:37 +0000"
  },
  {
    "title": "Millions more online consultation submissions by patients to practices in September",
    "description": "Millions of people are using online consultation requests to contact their GP practice each month, as the NHS gives people more choice in how they can safely contact their family doctor. New figures show 6.5 million online consultation requests were submitted to GPs in September 2025, up half compared to the same period last year [&#8230;]",
    "published": "Thu, 30 Oct 2025 15:21:11 +0000"
  },
  {
    "title": "Free ‘morning after pill’ for women at high street pharmacies thanks to NHS expansion",
    "description": "Women will be able to access the morning-after pill free of charge on the NHS in high-street pharmacies across England from today. In the “biggest change to sexual health services since the 1960s”, the oral emergency contraception pill will be available for free to women from almost 10,000 pharmacies across the country without needing to [&#8230;]",
    "published": "Wed, 29 Oct 2025 00:01:43 +0000"
  }
]