[
  {
    "title": "NHS artificial intelligence (AI) trial to diagnose prostate cancer up to a month faster",
    "description": "The NHS will test an AI-powered ‘one-day diagnostics’ service for prostate cancer that could transform diagnosis and save some men up to a month of waiting. The new ‘one stop shop’ pilot, funded by NHS England, will use artificial intelligence to interpret MRI scans for men with suspected prostate cancer, helping spot lesions in a [&#8230;]",
    "published": "Tue, 28 Oct 2025 09:21:15 +0000"
  },
  {
    "title": "NHS hospitals trialling 15-minute blood test for life-threatening conditions in children",
    "description": "An innovative 15-minute blood test which can fast-track the diagnosis of children with potentially life-threatening conditions is being trialled by the NHS this winter. The hi-tech blood test can distinguish between bacterial or viral infections much more quickly than traditional tests – so serious diseases like sepsis or meningitis can be picked up sooner.  NHS [&#8230;]",
    "published": "Mon, 27 Oct 2025 00:01:59 +0000"
  },
  {
    "title": "Fire station vaccine pop-ups to extinguish flu ‘wildfire’",
    "description": "Parents will be able to get their children protected against flu at a fire station this half term, as the NHS ramps up its winter vaccine campaign next week. England’s most senior nurse has warned parents that flu can spread like wildfire in schools and has urged them to ensure their children get vaccinated before [&#8230;]",
    "published": "Fri, 24 Oct 2025 23:01:34 +0000"
  },
  {
    "title": "Radical NHS reset to give patients faster care",
    "description": "The NHS is set to deliver faster care for millions of patients thanks to the most radical reset of the NHS in a generation. 2.5 million fewer patients will be waiting more than 18 weeks to receive planned care. 190,000 more cancer patients will begin potentially lifesaving treatment within 2 months of their referral over [&#8230;]",
    "published": "Fri, 24 Oct 2025 11:43:33 +0000"
  },
  {
    "title": "England’s leading doctors set out medical training recommendations",
    "description": "Two of England’s leading doctors have set out their recommendations following the first phase of a review into postgraduate medical training. The government’s Chief Medical Officer, Professor Chris Whitty, and the former National Medical Director at NHS England, Professor Stephen Powis, have led the Medical Training Review to understand current challenges and identify key areas [&#8230;]",
    "published": "Fri, 24 Oct 2025 11:35:51 +0000"
  }
]