[
  {
    "title": "NHS urges patients to access care and get vaccinated, amid new doctors’ strike and high flu cases",
    "description": "The NHS is urging patients not to put off coming forward for care, with thousands of resident doctors expected to walk out on strike for five days from today. Industrial action begins at 7am today (Wednesday 17 December) – lasting until 7am on Monday 22 December – and hospital teams across the country are working [&#8230;]",
    "published": "Wed, 17 Dec 2025 00:01:53 +0000"
  },
  {
    "title": "Risk associated with adult breathing circuits lacking a patent exhalation route",
    "description": "A national patient safety alert has been issued by the NHS England National Patient Safety team – in collaboration with the Faculty of Intensive Care Medicine – about the risk of harm from incorrectly assembled breathing circuits lacking a proper exhalation route for patients receiving invasive or non-invasive ventilatory support. Risk associated with adult breathing [&#8230;]",
    "published": "Thu, 11 Dec 2025 15:01:07 +0000"
  },
  {
    "title": "NHS facing ‘worst case scenario’ December amid ‘super flu’ surge",
    "description": "Flu hospitalisations have surged by more than half in just one week, plunging the NHS into a “worst case scenario” situation for December, new figures reveal today.  An average of 2,660 patients per day were in a hospital bed with flu last week – the highest ever for this time of year and up 55% [&#8230;]",
    "published": "Thu, 11 Dec 2025 10:11:55 +0000"
  },
  {
    "title": "NHS maternity signal system will spot and stop emerging safety concerns",
    "description": "Mothers and babies in England will receive safer care thanks to the roll out of a first-of-its-kind safety signal system across NHS maternity services. The sophisticated new tool rapidly analyses data being routinely recorded by maternity teams on wards to spot whether there are potential emerging safety issues which need urgent attention and action. If [&#8230;]",
    "published": "Mon, 08 Dec 2025 00:01:48 +0000"
  },
  {
    "title": "NHS ready for double whammy of winter flu-demic and strikes",
    "description": "The NHS is facing an unprecedented flu wave this winter with &#8220;no peak in sight yet&#8221; according to England’s top emergency care doctor. Latest figures show an average of 1,717 patients were in a hospital bed every day last week because of flu – the highest on record for this time of year. Cases were [&#8230;]",
    "published": "Thu, 04 Dec 2025 11:24:42 +0000"
  }
]