[
  {
    "title": "‘Life-changing’ AI support helping stroke patients get a second chance",
    "description": "Stroke patients in England are getting life-changing treatment more than an hour earlier thanks to a revolutionary “fast-track” AI tool, a major study has revealed. The landmark analysis published inThe Lancet Digital Health shows around 15,000 patients directly benefitted from having their scans reviewed by the tech. The AI tool — now rolled out by [&#8230;]",
    "published": "Tue, 02 Dec 2025 22:30:03 +0000"
  },
  {
    "title": "GPs managed record number of online requests in October",
    "description": "More than 8 million people submitted their GP request online during October 2025, up more than a fifth (21%) on the previous month and up more than two-thirds (68%) on last year. The new figures come as the NHS and government strive to make contacting your practice as easy as possible. Around 1 in 3 [&#8230;]",
    "published": "Thu, 27 Nov 2025 11:18:22 +0000"
  },
  {
    "title": "Personalised ‘living drug’ to offer “hope of cure” for aggressive leukaemia on NHS",
    "description": "Patients with an aggressive form of leukaemia will be able to receive a breakthrough immunotherapy on the NHS that saw over three quarters of patients go into remission in trials. The CAR T-cell therapy – known as ‘obe-cel’ – involves taking a patient&#8217;s immune cells and reprogramming them in a lab to identify and target [&#8230;]",
    "published": "Tue, 25 Nov 2025 00:01:20 +0000"
  },
  {
    "title": "NHS maintained almost all care for patients during doctors’ strike",
    "description": "The NHS managed to ‘safely keep the show on the road’ despite industrial action last week, with data showing more than 95% of planned elective activity going ahead for patients. Data published today shows the NHS met its ambitious goal to maintain 95% of planned care during this round of strike action – surpassing the [&#8230;]",
    "published": "Sun, 23 Nov 2025 09:17:41 +0000"
  },
  {
    "title": "National patient safety alert – harm from incorrect recording of penicillin allergy as penicillamine allergy",
    "description": "A joint National Patient Safety Alert has been issued by the NHS England National Patient Safety team, in collaboration with the Royal Pharmaceutical Society, Royal College of Physicians and Royal College of General Practitioners, about the risk of harm from inadvertently recording patients&#8217; penicillin allergies as penicillamine allergies in electronic prescribing and medicines administration (EPMA) [&#8230;]",
    "published": "Thu, 20 Nov 2025 10:00:32 +0000"
  }
]