[
  {
    "title": "NHS facing ‘worst case scenario’ December amid ‘super flu’ surge",
    "description": "Flu hospitalisations have surged by more than half in just one week, plunging the NHS into a “worst case scenario” situation for December, new figures reveal today.  An average of 2,660 patients per day were in a hospital bed with flu last week – the highest ever for this time of year and up 55% [&#8230;]",
    "published": "Thu, 11 Dec 2025 10:11:55 +0000"
  },
  {
    "title": "NHS maternity signal system will spot and stop emerging safety concerns",
    "description": "Mothers and babies in England will receive safer care thanks to the roll out of a first-of-its-kind safety signal system across NHS maternity services. The sophisticated new tool rapidly analyses data being routinely recorded by maternity teams on wards to spot whether there are potential emerging safety issues which need urgent attention and action. If [&#8230;]",
    "published": "Mon, 08 Dec 2025 00:01:48 +0000"
  },
  {
    "title": "NHS ready for double whammy of winter flu-demic and strikes",
    "description": "The NHS is facing an unprecedented flu wave this winter with &#8220;no peak in sight yet&#8221; according to England’s top emergency care doctor. Latest figures show an average of 1,717 patients were in a hospital bed every day last week because of flu – the highest on record for this time of year. Cases were [&#8230;]",
    "published": "Thu, 04 Dec 2025 11:24:42 +0000"
  },
  {
    "title": "A&Es under siege from hiccups and ingrowing toenails",
    "description": "Hundreds of thousands of patients attended A&#38;E last winter for everyday niggles such as hiccups and ingrowing nails, according to shocking new NHS data. There were more than 200,000 A&#38;E attendances last winter for conditions that could have been dealt with elsewhere – including 8,669 attendances for itchy skin and 96,998 for a sore throat. [&#8230;]",
    "published": "Thu, 04 Dec 2025 00:01:15 +0000"
  },
  {
    "title": "‘Life-changing’ AI support helping stroke patients get a second chance",
    "description": "Stroke patients in England are getting life-changing treatment more than an hour earlier thanks to a revolutionary “fast-track” AI tool, a major study has revealed. The landmark analysis published inThe Lancet Digital Health shows around 15,000 patients directly benefitted from having their scans reviewed by the tech. The AI tool — now rolled out by [&#8230;]",
    "published": "Tue, 02 Dec 2025 22:30:03 +0000"
  }
]