[
  {
    "title": "NHS to offer thousands of men life-extending prostate cancer drug",
    "description": "Thousands of men with prostate cancer will be offered a life-extending drug on the NHS within weeks. For the first time patients whose prostate cancer has not spread will be able to receive the drug in England, known as abiraterone, as the health service widens access to the treatment. Around 2,000 men diagnosed with prostate [&#8230;]",
    "published": "Fri, 16 Jan 2026 18:00:21 +0000"
  },
  {
    "title": "NHS backs AI notetaking to free up more face-to-face care",
    "description": "New AI notetaking tools being backed by the NHS could help doctors spend up to a quarter more time with their patients. NHS organisations across England are being urged to take advantage of a new national registry of 19 suppliers for the technology, which captures clinician–patient conversations and uses AI to accurately generate real-time transcriptions [&#8230;]",
    "published": "Thu, 15 Jan 2026 22:30:43 +0000"
  },
  {
    "title": "Second biggest drop in NHS waiting list in 15 years amid record number of patients",
    "description": "November saw the second biggest drop in the waiting list for 15 years outside of the early days of the pandemic, as new data today shows staff faced record demand in 2025. The waiting list fell by more than 86,000 in November to 7.31 million – and the milestone comes a year since the publication [&#8230;]",
    "published": "Thu, 15 Jan 2026 09:52:50 +0000"
  },
  {
    "title": "Bounce back in winter viruses as NHS top doctor warns ‘the worst is far from over’",
    "description": "Christmas and New Year gatherings may have caused a bounce back in winter viruses, as the health service also grapples with a vicious cold snap. Figures published today show that the number of patients in hospital beds with flu has risen by 9% on the previous week (2,924), following two weeks where that number had fallen. [&#8230;]",
    "published": "Thu, 08 Jan 2026 10:02:37 +0000"
  },
  {
    "title": "Menopause and prostate conditions prioritised for NHS’s new online hospital",
    "description": "Menopause and prostate problems will be among the priorities for the NHS’s revolutionary new online hospital when it launches next year. The NHS has selected nine common conditions which will be the first to be treated by the NHS Online service, providing faster access to specialist care. Launched by the Prime Minister in September 2025, [&#8230;]",
    "published": "Mon, 05 Jan 2026 22:30:58 +0000"
  }
]