[
  {
    "title": "Millions more online consultation submissions by patients to practices in September",
    "description": "Millions of people are using online consultation requests to contact their GP practice each month, as the NHS gives people more choice in how they can safely contact their family doctor. New figures show 6.5 million online consultation requests were submitted to GPs in September 2025, up half compared to the same period last year [&#8230;]",
    "published": "Thu, 30 Oct 2025 15:21:11 +0000"
  },
  {
    "title": "Free ‘morning after pill’ for women at high street pharmacies thanks to NHS expansion",
    "description": "Women will be able to access the morning-after pill free of charge on the NHS in high-street pharmacies across England from today. In the “biggest change to sexual health services since the 1960s”, the oral emergency contraception pill will be available for free to women from almost 10,000 pharmacies across the country without needing to [&#8230;]",
    "published": "Wed, 29 Oct 2025 00:01:43 +0000"
  },
  {
    "title": "NHS artificial intelligence (AI) trial to diagnose prostate cancer up to a month faster",
    "description": "The NHS will test an AI-powered ‘one-day diagnostics’ service for prostate cancer that could transform diagnosis and save some men up to a month of waiting. The new ‘one stop shop’ pilot, funded by NHS England, will use artificial intelligence to interpret MRI scans for men with suspected prostate cancer, helping spot lesions in a [&#8230;]",
    "published": "Tue, 28 Oct 2025 09:21:15 +0000"
  },
  {
    "title": "NHS hospitals trialling 15-minute blood test for life-threatening conditions in children",
    "description": "An innovative 15-minute blood test which can fast-track the diagnosis of children with potentially life-threatening conditions is being trialled by the NHS this winter. The hi-tech blood test can distinguish between bacterial or viral infections much more quickly than traditional tests – so serious diseases like sepsis or meningitis can be picked up sooner.  NHS [&#8230;]",
    "published": "Mon, 27 Oct 2025 00:01:59 +0000"
  },
  {
    "title": "Fire station vaccine pop-ups to extinguish flu ‘wildfire’",
    "description": "Parents will be able to get their children protected against flu at a fire station this half term, as the NHS ramps up its winter vaccine campaign next week. England’s most senior nurse has warned parents that flu can spread like wildfire in schools and has urged them to ensure their children get vaccinated before [&#8230;]",
    "published": "Fri, 24 Oct 2025 23:01:34 +0000"
  }
]