[
  {
    "title": "NHS in ‘calmer waters but not out of danger’ yet as winter viruses still circulating",
    "description": "Flu cases have begun to steady but hospital cases still surpassed 3,000 in the week before Christmas, a slight fall on the week before, according to new figures published today. Thanks in part to NHS staff ramping up vaccination efforts with half a million more people protected against flu compared to the same period last [&#8230;]",
    "published": "Wed, 31 Dec 2025 10:23:42 +0000"
  },
  {
    "title": "NHS diabetes prevention scheme helps one million people",
    "description": "Nearly one million people in England have started a specialist NHS scheme which can prevent or delay the onset of Type 2 diabetes, according to new analysis. The NHS’s Healthier You Programme is a clinically proven weight management and lifestyle change initiative, and was one of the world&#8217;s first diabetes prevention schemes when it was launched in 2016. [&#8230;]",
    "published": "Tue, 30 Dec 2025 00:01:35 +0000"
  },
  {
    "title": "NHS former chief executive among health service honours",
    "description": "The former Chief Executive of NHS England and a clinician who set up a service for refugee doctors are among those recognised on the New Years Honours list, released today (Monday 29 December).  Around three dozen NHS staff including nurses, surgeons, and GPs have been recognised for their service. The head of the NHS, Sir [&#8230;]",
    "published": "Mon, 29 Dec 2025 22:30:39 +0000"
  },
  {
    "title": "Record numbers using NHS App to manage health",
    "description": "Record numbers of people are using the NHS App to manage their health, according to the latest statistics. The NHS has released a Spotify Wrapped-style end-of-year update which shows the NHS App now has more than 39 million registered users. A total of 67.8 million repeat prescriptions were also ordered through the app in the past 12 months (1 [&#8230;]",
    "published": "Wed, 24 Dec 2025 00:01:28 +0000"
  },
  {
    "title": "Public urged to use NHS as normal over weekend of strike action",
    "description": "The NHS is reminding the public to continue coming forward for care as normal over the last 2 days of strike action this weekend. This period of industrial action by resident doctors began at 7am on Wednesday 17 December and will continue until 7am on Monday 22 December. Despite rising flu cases and other winter [&#8230;]",
    "published": "Sat, 20 Dec 2025 00:01:11 +0000"
  }
]