[
  {
    "title": "Fire station vaccine pop-ups to extinguish flu ‘wildfire’",
    "description": "Parents will be able to get their children protected against flu at a fire station this half term, as the NHS ramps up its winter vaccine campaign next week. England’s most senior nurse has warned parents that flu can spread like wildfire in schools and has urged them to ensure their children get vaccinated before [&#8230;]"
  },
  {
    "title": "Radical NHS reset to give patients faster care",
    "description": "The NHS is set to deliver faster care for millions of patients thanks to the most radical reset of the NHS in a generation. 2.5 million fewer patients will be waiting more than 18 weeks to receive planned care. 190,000 more cancer patients will begin potentially lifesaving treatment within 2 months of their referral over [&#8230;]"
  },
  {
    "title": "England’s leading doctors set out medical training recommendations",
    "description": "Two of England’s leading doctors have set out their recommendations following the first phase of a review into postgraduate medical training. The government’s Chief Medical Officer, Professor Chris Whitty, and the former National Medical Director at NHS England, Professor Stephen Powis, have led the Medical Training Review to understand current challenges and identify key areas [&#8230;]"
  },
  {
    "title": "NHS to roll out first long-acting injection to prevent HIV",
    "description": "Around 1,000 people at risk of HIV will be offered a new long-acting injection on the NHS if they cannot have pills to protect them from the virus. The rollout of this preventative therapy takes NHS England one step closer to its goal of eliminating HIV transmissions in the next five years. The cabotegravir injection [&#8230;]"
  },
  {
    "title": "NHS to screen all newborn babies for life-threatening metabolic disorder",
    "description": "Newborn babies will now be routinely screened and treated earlier on the NHS for a rare, life-threatening metabolic disorder, which can result in the need for a liver transplant. Hereditary Tyrosinaemia Type 1 (HT1) is a rare, genetically inherited disorder that affects around 7 babies per year in the UK. Left untreated, it can lead [&#8230;]"
  }
]