[
  {
    "title": "NHS far from complacent despite drop in flu admissions",
    "description": "The number of people in hospital with flu dropped off during Christmas week (w/e 28 December), but England’s top doctor has warned that the NHS is ‘far from complacent’ during the cold snap. Amber and yellow cold health alerts for England have been issued by UKHSA as temperatures have fallen in recent days to drop below [&#8230;]",
    "published": "Fri, 02 Jan 2026 10:17:28 +0000"
  },
  {
    "title": "Hundreds of thousands of young children now to be protected against chickenpox",
    "description": "Hundreds of thousands of families with young children will be offered protection against chickenpox as part of their routine childhood vaccinations from today. The NHS’s vaccination programme is being expanded to include chickenpox (also known as varicella) for the first time to help shield young children from getting seriously ill. From now on, GP practices will start to offer children a [&#8230;]",
    "published": "Fri, 02 Jan 2026 00:01:21 +0000"
  },
  {
    "title": "NHS in ‘calmer waters but not out of danger’ yet as winter viruses still circulating",
    "description": "Flu cases have begun to steady but hospital cases still surpassed 3,000 in the week before Christmas, a slight fall on the week before, according to new figures published today. Thanks in part to NHS staff ramping up vaccination efforts with half a million more people protected against flu compared to the same period last [&#8230;]",
    "published": "Wed, 31 Dec 2025 10:23:42 +0000"
  },
  {
    "title": "NHS diabetes prevention scheme helps one million people",
    "description": "Nearly one million people in England have started a specialist NHS scheme which can prevent or delay the onset of Type 2 diabetes, according to new analysis. The NHS’s Healthier You Programme is a clinically proven weight management and lifestyle change initiative, and was one of the world&#8217;s first diabetes prevention schemes when it was launched in 2016. [&#8230;]",
    "published": "Tue, 30 Dec 2025 00:01:35 +0000"
  },
  {
    "title": "NHS former chief executive among health service honours",
    "description": "The former Chief Executive of NHS England and a clinician who set up a service for refugee doctors are among those recognised on the New Years Honours list, released today (Monday 29 December).  Around three dozen NHS staff including nurses, surgeons, and GPs have been recognised for their service. The head of the NHS, Sir [&#8230;]",
    "published": "Mon, 29 Dec 2025 22:30:39 +0000"
  }
]