[
  {
    "title": "Waiting list down as NHS ‘approaches its limit’ ahead of strikes and flu",
    "description": "The NHS waiting list is 230,000 lower than July last year, even as the health service ‘approaches its limit’ with A&#38;E and ambulances facing record demand ahead of winter. The overall waiting list for September was 7.39 million (an estimated 6.24 million patients) down 15,845 compared to the previous month and 230,000 fewer than July [&#8230;]",
    "published": "Thu, 13 Nov 2025 13:21:06 +0000"
  },
  {
    "title": "Hundreds more blood cancer patients to receive life-giving drug on NHS",
    "description": "Hundreds more people with an aggressive form of blood cancer can now be offered hope of a cure and “a new lease of life” from today thanks to an NHS drug rollout. Glofitamab (Columvi®) will now be offered to around 300 people a year with relapsed or refractory diffuse large B-cell lymphoma (DLBCL) — a [&#8230;]",
    "published": "Thu, 13 Nov 2025 00:01:56 +0000"
  },
  {
    "title": "Record numbers of people with type 2 diabetes benefit from NHS ‘soups and shakes’",
    "description": "The NHS supported a record number of people with type 2 diabetes to sign up to its ‘soups and shakes’ diet programme last year, helping them to lose weight and potentially put their condition into remission. Over 13,000 people were enrolled onto the NHS Type 2 Diabetes Path to Remission Programme, also known as the [&#8230;]",
    "published": "Sat, 08 Nov 2025 00:01:04 +0000"
  },
  {
    "title": "NHS issues flu jab SOS with worst of winter only weeks away",
    "description": "The NHS has issued a ‘flu jab SOS’, with England’s top nurse warning people to get protected now, with only weeks to go before the worst of the flu season typically bites. Eligible adults are being urged to come forward now, so they are fully protected ahead of the usual flu season peak in the [&#8230;]",
    "published": "Thu, 06 Nov 2025 10:17:55 +0000"
  },
  {
    "title": "NHS England responds to ADHD Taskforce final report",
    "description": "An independent taskforce established to tackle challenges in attention deficit hyperactivity disorder (ADHD) care has today (6 November 2025) published its final report. The ADHD Taskforce final report assessed services across health, education, employment, and the criminal justice system. The independent report recognises that cross-sector services across the country are under significant pressure due to [&#8230;]",
    "published": "Thu, 06 Nov 2025 09:27:14 +0000"
  }
]